

cancel-authn.title = Avbruten legitimering
cancel-authn.message = Inloggningen avbr\u00f6ts

fraud.title = S\u00e4kerhetsmeddelande
fraud.message = Ett bedr\u00e4gligt inloggningsf\u00f6rs\u00f6k har detekterats. Legitimeringen avvisades
                
possible-fraud.title = S\u00e4kerhetsmeddelande
possible-fraud.message = Legitimeringstj\u00e4nsten har detekterat ett misst\u00e4nkt inloggningsf\u00f6rs\u00f6k. Legitimeringen avbruten

sign-message-decryption-error.title = S\u00e4kerhetsmeddelande
sign-message-decryption-error.message = Signeringsmeddelandet kunde inte dekrypteras

sign-message-unsupported-mimetype.title = S\u00e4kerhetsmeddelande
sign-message-unsupported-mimetype.message = Den beg\u00e4rda typen f\u00f6r visning av signeringsmeddelandet hanteras inte av legitimeringstj\u00e4nsten

sweid-bad-request.title = Beg\u00e4ran st\u00f6ds inte
sweid-bad-request.message = Legitimeringsbeg\u00e4ran m\u00f6ter inte kraven f\u00f6r g\u00e4llande tekniskt ramverk 

bad-sad-request.title = S\u00e4kerhetsmeddelande
bad-sad-request.message = Beg\u00e4ran av SAD \u00e4r inte korrekt 

# General strings

idp.title = Logintj\u00e4nsten
idp.title.suffix = Error
idp.logo = /images/dummylogo.png
idp.logo.alt-text = Replace or remove this logo
idp.message = Ett ov\u00e4ntat fel intr\u00e4ffade.
idp.footer = Insert your footer text here.

root.title = Shibboleth Legitimeringstj\u00e4nst
root.message = Inga tj\u00e4nster finns tillg\u00e4ngliga p\u00e5 den h\u00e4r platsen.
root.footer = Insert your footer text here.

idp.client-storage-read.title = Laddar sessionsinformation
idp.client-storage-read.text = Laddar sessionsinformation from webbl\u00e4saren...
idp.client-storage-write.title = Sparar sessionsinformation
idp.client-storage-write.text = Sparar sessionsinformation till webbl\u00e4saren...
idp.client-storage.no-js = Eftersom din webbl\u00e4sare inte st\u00f6djer JavaScript \
                           m\u00e5ste du klicka p\u00e5 "Forts\u00e4tt" f\u00f6r att komma vidare.

# Login / Logout messages

idp.login.loginTo = Logga in till

idp.login.username = Anv\u00e4ndarnamn
idp.login.password = L\u00f6senord

idp.login.donotcache = Kom inte ih\u00e5g min inloggning

idp.login.login = Logga in
idp.login.pleasewait = Loggar in, var god v\u00e4nta...

idp.login.forgotPassword = Gl\u00f6mt ditt l\u00f6senord?
idp.login.needHelp = Beh\u00f6ver du hj\u00e4lp?

idp.login.duoRequired = Autentisering med Duo kr\u00e4vs f\u00f6r den beg\u00e4rda tj\u00e4nsten.
idp.login.duoNoScript = Duo-tj\u00e4nsten kr\u00e4ver JavaScript.
idp.login.duoCancel = Avbryt beg\u00e4ran

# Expiring password example messages

idp.login.expiringSoon = Ditt l\u00f6senord l\u00f6per snart ut!
idp.login.changePassword = F\u00f6r att skapa ett nytt l\u00f6senord, g\u00e5 till
idp.login.proceedBegin = Din inloggning forts\u00e4tter inom 20 sekunder. Du kan ocks\u00e5 klicka
idp.login.proceedHere = h\u00e4r
idp.login.proceedEnd = f\u00f6r att forts\u00e4tta

# Useful links

idp.url.password.reset = #
idp.url.helpdesk = #

# User Preferences example messages

idp.userprefs.title = Logintj\u00e4nsten
idp.userprefs.title.suffice = Inloggningsinst\u00e4llningar
idp.userprefs.info = P\u00e5 denna sida kan du konfigurera din enhet att meddela inloggningstj\u00e4nsten att den \ 
                     kan anv\u00e4nda mer avancerade inloggningsmetoder \u00e4n vanligt.
idp.userprefs.options = F\u00f6ljande val finns:
idp.userprefs.spnego = Anv\u00e4nd automatisk inloggning om den finns tillg\u00e4nglig.
idp.userprefs.no-js = Denna funktion kr\u00e4ver JavaScript.


# Logout-related messages

idp.logout.ask = Vill du f\u00f6rs\u00f6ka logga ut fr\u00e5n alla tj\u00e4nster du anv\u00e4nt under denna session? \
                 V\u00e4lj <strong>Ja</strong> eller <strong>Nej</strong> f\u00f6r att s\u00e4kerst\u00e4lla att \
                 utloggningen forts\u00e4tter, eller v\u00e4nta n\u00e5gra sekunder f\u00f6r "Ja".
idp.logout.contactServices = Om du forts\u00e4tter kommer systemet att f\u00f6rs\u00f6ka kontakta f\u00f6ljande tj\u00e4nster:
idp.logout.complete = Utloggningen \u00e4r f\u00e4rdig. Inga andra tj\u00e4nster verkar ha anv\u00e4nts under denna session.
idp.logout.local = Du valde att inte logga ut fr\u00e5n de tj\u00e4nster du anv\u00e4nt under denna session.
idp.logout.attempt = F\u00f6rs\u00f6ker logga ut fr\u00e5n f\u00f6ljande tj\u00e4nster:

# Messages related to attribute release consent.

idp.attribute-release.revoke                       = Nollst\u00e4ll tidigare medgivanden f\u00f6r informationsleverans till denna tj\u00e4nst.

idp.attribute-release.title                        = Informationsleverans 

idp.attribute-release.attributesHeader             = Information som levereras till tj\u00e4nsten

idp.attribute-release.serviceNameLabel             = Du kommer att bes\u00f6ka tj\u00e4nsten:
idp.attribute-release.of                           = av
idp.attribute-release.serviceDescriptionLabel      = Beskrivning fr\u00e5n denna tj\u00e4nst:

idp.attribute-release.informationURLLabel          = Ytterligare information om tj\u00e4nsten
idp.attribute-release.privacyStatementURLLabel     = Integritetsinformation om tj\u00e4nsten

idp.attribute-release.showDetails                  = visa detaljer

idp.attribute-release.accept                       = Acceptera
idp.attribute-release.reject                       = Avvisa

idp.attribute-release.confirmationQuestion         = Informationen ovan delas med tj\u00e4nsten om du forts\u00e4tter. \
                                                     Samtycker du till att denna information delas med tj\u00e4nsten varje g\u00e5ng du bes\u00f6ker den?

idp.attribute-release.consentMethod                = V\u00e4lj hur l\u00e4nge ditt medgivande ska g\u00e4lla:
idp.attribute-release.consentMethodRevoke          = Denna inst\u00e4llning kan nollst\u00e4llas senare med rutan p\u00e5 loginsidan.

idp.attribute-release.doNotRememberConsent         = Fr\u00e5ga mig igen vid n\u00e4sta inloggning
idp.attribute-release.doNotRememberConsentItem     = Jag samtycker att skicka min information denna g\u00e5ng.

idp.attribute-release.rememberConsent              = Fr\u00e5ga mig igen om information som delas med denna tj\u00e4nst f\u00f6r\u00e4ndras
idp.attribute-release.rememberConsentItem          = Jag samtycker att samma information delas automatiskt med denna tj\u00e4nst i framtiden.

idp.attribute-release.globalConsent                = Fr\u00e5ga mig inte igen
idp.attribute-release.globalConsentItem            = Jag samtycker att <strong>all</strong> min information delas med <strong>alla</strong> tj\u00e4nster. 

# General messages related to terms of use consent.

idp.terms-of-use.accept     = Jag accepterar anv\u00e4ndarvillkoren
idp.terms-of-use.submit     = Skicka
idp.terms-of-use.reject     = Avvisa
idp.terms-of-use.required   = Kryssa i denna ruta om du vill forts\u00e4tta

# Triples consisting of a TOU key, and a title and text for each set of terms.
# The default implementation uses the SP name as the key, but this can be overriden.

https\://sp.example.org = example-tou-1
example-tou-1.title = Example Terms of Use
example-tou-1.text  = <em>*** This is an example ToU - tailor due to your needs ***</em> \
                        <p>Example organization AAI services: Terms of Use (ToU)</p> \
                        <strong>A. Data Protection Sample Clause</strong> \
                        <p> \
                        "The End User notes that personal data about the End User is compiled from generally \
                        available sources and from communications received from the End User and other \
                        Universities as well as from off-site sources. The policy relating to the use and procession \
                        of such data is posted on the University website at [...]. Such data will be used, inter alia, \
                        to authenticate and authorize the access to and use of various resources within \
                        the University and on other sites ("Approved Uses"). The End User hereby consents to \
                        the collection, processing, use and release of such data to the extent reasonably necessary \
                        for the Approved Uses. Such consent includes, but is not limited to, the release \
                        of personal data to other institutions by employing cookies and electronically exchanging, \
                        caching and storing personal authorization attributes." \
                        </p> \
                        <strong>B. Limitation of Liability</strong> \
                        <p> \
                        "To the extent permitted by the applicable law, the End User hereby waives all and any \
                        claims for cost and damages, whether direct or indirect, incidental, or consequential(including, \
                        inter alia, loss of use and lost profits), both in contract and in tort, arising from \
                        the use or in any way related to the inter-organizational authentication and authorization \
                        services which allow the End User to access certain resources of other organizations. \
                        This waiver of claims shall be valid and effective in relation to all participants of \
                        the inter-organizational authentication and authorization services including the AAI \
                        Service Provider and its affiliates, officers, employees and agents." \
                        </p>
                        
# Error key to title and message mappings

access.title = \u00c5tkomst nekad
access.message = Du har inte till\u00e5telse att n\u00e5 den efterfr\u00e5gade tj\u00e4nsten.

context-check-denied.title = \u00c5tkomst nekad
context-check-denied.message = Du har inte r\u00e4ttigheter att anv\u00e4nda den beg\u00e4rda tj\u00e4nsten.

no-release.title = Delning av information hindrad
no-release.message = P\u00e5 din beg\u00e4ran har delning av din information stoppats. Om du \u00f6nskar \
                      \u00e4ndra det beslutet kan du bes\u00f6ka tj\u00e4nsten senare och samtycka till delning av information.  

no-terms.title = Anv\u00e4ndningsvillkor ej accepterade
no-terms.message = Eftersom du inte samtyckt till de obligatoriska anv\u00e4ndingsvillkoren medges ingen \u00e5tkomst till tj\u00e4nsten.
                    On du \u00f6nskar \u00e4ndra ditt beslut kan du bes\u00f6ka tj\u00e4nsten igen och samtycka till anv\u00e4ndningsvillkoren.

authn.title = Inloggningen misslyckades
authn.message = Legitimeringen misslyckades, eller motsvarande inte kraven fr\u00e5n den tj\u00e4nst som beg\u00e4rt legitimering.

bad-username.message = Anv\u00e4ndarnamndet du angav finns inte

bad-password.message = L\u00f6senordet du angav \u00e4r inte korrekt.

expired-password.message = Ditt l\u00f6senord har l\u00f6pt ut.

account-locked.message = Ditt konto \u00e4r l\u00e5st.

spnego-unavailable.message = Din webbl\u00e4sare st\u00f6djer inte legitimering med din inloggningsinformation.
spnego-unavailable.return = Avbryt f\u00f6rs\u00f6ket.

ntlm.message = Din webbl\u00e4sare f\u00f6rs\u00f6kte anv\u00e4nda en svagare form av legitimering.

endpoint.title = Kunde inte svara
endpoint.message = Legitimeringstj\u00e4nsten kunde inte hitta ett passande s\u00e4tt att svara till den \
                    tj\u00e4nst som beg\u00e4rt legitimering. Detta beror vanligtvis p\u00e5 en felaktig konfiguration \
                    hos tj\u00e4nsten som beg\u00e4rt legitimering, och b\u00f6r rapporteras till tj\u00e4nstens support.

relying-party.title = Beg\u00e4ran kan inte hanteras
relying-party.message = Tj\u00e4nsten som beg\u00e4rt din legitimering \u00e4r inte registrerad f\u00f6r att anv\u00e4nda denna legitimeringstj\u00e4nst. 

security-cfg.title = Konfigurationsfel
security-cfg.message = Legitimeringstj\u00e4nsten och tj\u00e4nsten som beg\u00e4rt legitimering har inte kompatibla \
                        s\u00e4kerhetsinst\u00e4llnings. Beg\u00e4ran kan inte betj\u00e4nas.

security-msg.title = Konfigurationsfel
security-msg.message = Beg\u00e4ran kan inte betj\u00e4nas eftersom mottaget meddelande inte motsvarar \
                        legitimeringstj\u00e4nstens s\u00e4kerhetskrav.

stale.title = Felaktig beg\u00e4ran
stale.message = <p>Denna sida visas p\u00e5 grund av att du anv\u00e4nt Tillbaka-knappen i din webbl\u00e4sare \
                 d\u00e5 du \u00e4r i inloggat l\u00e4ge, eller att du av misstag skapat ett bokm\u00e4rke \
                 till legitimeringstj\u00e4nsten ist\u00e4llet f\u00f6r den tj\u00e4nst du loggar in till, eller att \
                 du anv\u00e4nt en l\u00e4nk som pekar till legitimeringstj\u00e4nstens inloggningsfl\u00f6de.</p> \

unexpected.title = Ett ov\u00e4ntat fel intr\u00e4ffade
unexpected.message = Ett ov\u00e4ntat fel har intr\u00e4ffat, vanligtvis beroende p\u00e5 konfigurations- eller mjukvaruproblem.

runtime-error.title = Ett ov\u00e4ntat fel intr\u00e4ffade
runtime-error.message = <p>Ett mjukvarufel intr\u00e4ffade:</p><br/> \
                         <p><strong>#if($exception)$encoder.encodeForHTML($exception.toString())#elseif($flowExecutionException && $flowExecutionException.getCause())$encoder.encodeForHTML($flowExecutionException.getCause().toString())#else$encoder.encodeForHTML($flowExecutionException.getMessage())#end</strong></p><br/> \
                         <p>V\u00e4nligen rapportera detta fel till legitimeringstj\u00e4nstens support. Det har \
                         ocks\u00e5 loggats s\u00e5 att supportpersonal kan \u00e5tg\u00e4rda felet.</p>

error.title = Fel
error.message = Ett fel intr\u00e4ffade: $eventId

exception-error.title = Tekniskt fel
exception-error.message = <p>Vi beklagar, men ett tekniskt fel intr\u00e4ffade.</p><p>Var god f\u00f6rs\u00f6k senare.</p>

